"""
Створіть клас геометричної фігури "Ромб". Клас повинен мати наступні атрибути:

сторона_а (довжина сторони a).
кут_а (кут між сторонами a і b).
кут_б (суміжний з кутом кут_а).
Необхідно реалізувати наступні вимоги:

Значення сторони сторона_а повинно бути більше 0.
Кути кут_а та кут_б повинні задовольняти умову: кут_а + кут_б = 180
Протилежні кути ромба завжди рівні, тому при заданому значенні кут_а, значення кут_б обчислюється автоматично.
Для встановлення значень атрибутів використовуйте метод __setattr__.
"""
class rhombus:
    def __init__(self, a, angle_a):
        self.a = a
        self.angle_a = angle_a

    def __setattr__(self, key, value):
        if key == "a":
            if value <= 0:
                raise AttributeError("Сторона повинна бути більше 0")
            object.__setattr__(self, key, value)
        elif key == "angle_a":
            if not (0 < value < 180):
                 raise AttributeError("Кут повинен бути більше 0 і менше за 180")

            object.__setattr__(self, key, value)
            object.__setattr__(self, "angle_b", 180 - value)

r = rhombus(150, 150)
print(r.__dict__)